import { FC } from 'react'

const PrivacyPolicy: FC = () => {
  return (
    <div className="container py-5">
      <h1 className="mb-4">Политика конфиденциальности</h1>
      <p>Дата вступления в силу: 25 мая 2024 года</p>

      <h2 className="mt-5">1. Общие положения</h2>
      <p>
        Настоящая политика конфиденциальности (далее – «Политика») действует в отношении всей информации,
        которую Maytry (далее – «Мы», «наш») может получить о пользователе
        во время использования им любого из сайтов, служб, программ, продуктов или услуг
        Maytry (далее – «Сервисы») и в ходе исполнения нами любых
        соглашений и договоров с пользователем.
      </p>

      <h2 className="mt-5">2. Какие персональные данные мы собираем</h2>
      <p>
        Мы можем собирать следующие категории персональных данных:
        <ul>
          <li>
            <strong>Информация, предоставляемая вами при регистрации:</strong> имя, адрес электронной почты, номер телефона, дата рождения.
          </li>
          <li>
            <strong>Данные, которые автоматически передаются Сервисам в процессе их использования с помощью установленного на устройстве пользователя программного обеспечения:</strong> IP-адрес, данные файлов cookie, информация о браузере пользователя (или иной программе, с помощью которой осуществляется доступ к Сервисам), технические характеристики оборудования и программного обеспечения, используемых пользователем, дата и время доступа к Сервисам, адреса запрашиваемых страниц и иная подобная информация.
          </li>
          <li>
            <strong>Данные о транзакциях:</strong> информация о заказах, покупках, способах оплаты и доставки.
          </li>
          <li>
            <strong>Иная информация о пользователе,</strong> обработка которой предусмотрена условиями использования отдельных Сервисов.
          </li>
        </ul>
      </p>

      <h2 className="mt-5">3. Цели обработки персональных данных</h2>
      <p>
        Мы обрабатываем ваши персональные данные для следующих целей:
        <ul>
          <li>Идентификация стороны в рамках Сервисов, соглашений и договоров с нами.</li>
          <li>Предоставление пользователю персонализированных Сервисов и исполнение соглашений и договоров.</li>
          <li>Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Сервисов, исполнения соглашений и договоров, а также обработка запросов и заявок от пользователя.</li>
          <li>Улучшение качества Сервисов, удобства их использования, разработка новых Сервисов.</li>
          <li>Проведение статистических и иных исследований на основе обезличенных данных.</li>
          <li>Таргетирование рекламных материалов.</li>
        </ul>
      </p>

      <h2 className="mt-5">4. Передача персональных данных третьим лицам</h2>
      <p>
        Мы не передаем ваши персональные данные третьим лицам, за исключением следующих случаев:
        <ul>
          <li>Пользователь выразил согласие на такие действия.</li>
          <li>Передача необходима для использования пользователем определенного Сервиса либо для исполнения определенного соглашения или договора с пользователем.</li>
          <li>Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры.</li>
        </ul>
      </p>

      <h2 className="mt-5">5. Ваши права</h2>
      <p>
        Вы имеете право:
        <ul>
          <li>Получать информацию о ваших персональных данных и вносить в них изменения.</li>
          <li>Требовать удаления ваших персональных данных.</li>
          <li>Отозвать свое согласие на обработку персональных данных.</li>
        </ul>
        Для реализации этих прав, пожалуйста, свяжитесь с нами по электронной почте: sale@maytry.ru.
      </p>

      <h2 className="mt-5">6. Меры по защите персональных данных</h2>
      <p>
        Мы принимаем необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.
      </p>

      <h2 className="mt-5">7. Изменение Политики конфиденциальности</h2>
      <p>
        Мы имеем право вносить изменения в настоящую Политику. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики.
      </p>

      <h2 className="mt-5">8. Контактная информация</h2>
      <p>
        Если у вас есть вопросы или предложения по поводу настоящей Политики, пожалуйста, свяжитесь с нами по адресу: sale@maytry.ru.
      </p>
    </div>
  )
}

export default PrivacyPolicy 